use [Maiseyeu_04]
--Lab6
--ѕрограммирование T-SQL.


--1.	–азработать хранимые процедуры: 
--1.1.	ƒобавлени€ нового клиента; при попытке дублировани€ данных Ч вывести сообщение об ошибке.
--1.2.	ѕоиска клиента по части названи€; если такого не нашлось Ч вывести сообщение.
--1.3.	ќбновлени€ данных клиента.
--1.4.	”далени€ данных о клиенте; если у клиента есть заказы, и его нельз€ удалить Ч вывести сообщение. 
--2.	¬ызвать разработанные процедуры с различными параметрами дл€ демонстрации.
--3.	–азработать пользовательские функции: 
--3.1.	ѕодсчитать количество заказов сотрудника в определенный период. ≈сли такого сотрудника нет Ч вернуть -1. ≈сли сотрудник есть, а заказов нет Ч вернуть 0.
--3.2.	ѕодсчитать количество товаров различных производителей ценой выше указанной. 
--3.3.	ѕодсчитать количество заказанных товаров дл€ определенного производител€.
--4.	¬ызвать разработанные функции различными способами с различными параметрами дл€ демонстрации.
